package day01;
//变量
public class BianLiang {
	
}

/*
 * 1. 字面值常量
 * 		一样看上去就知道是多少的值。
 * 		内存中一块有类型，有值的空间
 * 		字面值不能重复使用，因为空间没有名字，所以不能再使用。
 * 		在字面值使用过一次之后，回收机制就会将这个内容回收，然后再使用的话就会再创建一个空间
 * 2. 字面值使用十分的不方便。所以引入了变量。
 * 		变量是内容中有类型，有值的空间，且有名字。
 * 3. 如果声明变量 与赋值
 * 		声明： 数据类型  变量名
 * 			int是一种数据类型，表示整型。
 * 			int a 表示在内存中开辟了一块整型，名字叫做a的变量
 * 		赋值： 变量名 = 值。
 * 			a = 1； 将1这个整数放入到a这个空间。
 * 注：类体中不能有java代码，可以写在方法体里面和构造体里面。 
 * 		变量的值可以改变。可以重新赋值。
 * 4. 深入了解变量
 * 		在同一个域中，变量名不能重复。
 * 		java中变量必须先声明后赋值。才能使用。
 * 		变量的声明可以同时进行。
 * 		int a1,a2,a3=10;
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * */
