package day01;

public class Keywords {
	
}

/*
 * 	1. java中关键字都是小写的。
 * 		在eclipse里面的关键字显示为深红色
 * 		保留字
 * 	2. 标识符
 * 		用于标识类名，方法名，接口名，变量名
 * 		就是起名字的。
 * 	命名规则：标识符必须由数字，字母，下划线，$与￥构成，其他的符号不可以
 * 			不能以数字开头，其他的可以。
 * 	特点：	关键字不能作为标识符
 * 			标识符严格区分大小写
 * 			标识符理论上没有长度限制，但是完全没必要这样
 * 	命名java标识符最好见名知意
 * 	几个规范：
 * 		类名和接口使用大驼峰式命名，所有单词的首字母大写
 * 		方法名：	小驼峰命名除了第一个单词之外，其他字母首字母大写
 * 		变量命名：	可以大小写混写。
 * 		常量命名： 	全部大写	而且单词与单词之间用下划线隔开。
 * 		常量：
 * 			public static final int NUMBER_INT = 1;
 * 		
 * 		
 * 		
 * 		
 * 		
 * 
 * 
 * */
