package day02;

public class Type {
	
}

/*
 * 数据类型
 * 	整数型：
 * 		byte
 * 		short
 * 		int
 * 		long
 * 	这几个的区别，
 * 		在用二进制表示时，占的字节不同
 * 		byte 	1个字节
 * 		short	2个字节
 * 		int		4个字节
 * 		long	8个字节
 * 	1字节(1 byte) = 8 bit 比特
 * 	使用二进制表示时：以10为例
 * 		byte 	-> 00001010
 * 		short	-> 00000000 x1 00001010
 * 		int		-> 00000000 x3 00001010
 * 		long	-> 00000000 x7 00001010
 * 	因此byte最大能够表示到-128 到 + 127
 * 		short 能够表示 -2^15 ~ 2^15 -1 
 * 		int   能够表示 -2^31 ~ 2^31 -1
 * 		long  能够表示 -2^63 ~ 2^63 -1
 *	四个整数型，如果没有赋值，默认值为0
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * */
